# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language.

We can think of a DataFrame as a bunch of Series objects put together to share the same index.

Let's use pandas to explore this topic!

In [2]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn
np.random.seed(101)

In [4]:
# Example 1
temp=np.random.randint(low=20,high=100,size=20)
temp

array([31, 90, 83, 95, 29, 97, 60, 24, 83, 60, 80, 84, 25, 32, 60, 69, 28,
       49, 79, 54])

In [5]:
# Or we can define temp as
temp=np.random.randint(20,100,20)
name=np.random.choice(['Akshay',"Arun","Aravind","Ajay"],20)
random=np.random.choice([10,11,13,12,14],20)
a=list(zip(temp,name,random))

In [6]:
df1=pd.DataFrame(data=a,columns=['temp','name','random'],)
df1

    temp     name  random
0     64     Ajay      12
1     92     Ajay      13
2     39     Ajay      12
3     30     Ajay      13
4     96   Akshay      12
5     20   Akshay      14
6     93   Akshay      14
7     28  Aravind      12
8     82   Akshay      10
9     56     Arun      13
10    48   Akshay      13
11    83     Ajay      12
12    27     Ajay      11
13    30     Ajay      13
14    72     Arun      13
15    76     Arun      13
16    58   Akshay      14
17    93   Akshay      12
18    72   Akshay      12
19    38     Ajay      13

In [7]:
# Example 2

from numpy.random import randn
np.random.seed(101)

In [8]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [9]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [10]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [11]:
# Pass a list of column names this will select mulitple columns
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [12]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [13]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [14]:
df['new'] = df['W'] + df['Y']

In [15]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**Removing Columns**

In [18]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
# The change is temporary inorder to make the change permanent
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
df.drop('new',axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Can also drop rows this way:

In [20]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**Selecting Rows**

In [21]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

we can even select based off of position instead of Row name

In [22]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

**Selecting subset of Rows and columns**

In [23]:
df.loc['B','Y']

-0.8480769834036315

In [24]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

**Set Index**

In [25]:
df.set_index('W',inplace=True)
df

                  X         Y         Z
W
 2.706850  0.628133  0.907969  0.503826
 0.651118 -0.319318 -0.848077  0.605965
-2.018168  0.740122  0.528813 -0.589001
 0.188695 -0.758872 -0.933237  0.955057
 0.190794  1.978757  2.605967  0.683509

In [26]:
df.sort_index(axis=0,ascending=True)

                  X         Y         Z
W
-2.018168  0.740122  0.528813 -0.589001
 0.188695 -0.758872 -0.933237  0.955057
 0.190794  1.978757  2.605967  0.683509
 0.651118 -0.319318 -0.848077  0.605965
 2.706850  0.628133  0.907969  0.503826

In [27]:
df.sort_index(axis=0,ascending=False)

                  X         Y         Z
W
 2.706850  0.628133  0.907969  0.503826
 0.651118 -0.319318 -0.848077  0.605965
 0.190794  1.978757  2.605967  0.683509
 0.188695 -0.758872 -0.933237  0.955057
-2.018168  0.740122  0.528813 -0.589001

In [28]:
df.sort_values(by='X', ascending=False)
df

                  X         Y         Z
W
 2.706850  0.628133  0.907969  0.503826
 0.651118 -0.319318 -0.848077  0.605965
-2.018168  0.740122  0.528813 -0.589001
 0.188695 -0.758872 -0.933237  0.955057
 0.190794  1.978757  2.605967  0.683509

In [29]:
# Set default index as index
df.reset_index(inplace=True)
df

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [30]:
df

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [31]:
df>0

       W      X      Y      Z
0   True   True   True   True
1   True  False  False   True
2  False   True   True  False
3   True  False  False   True
4   True   True   True   True

In [32]:
df[df>0]

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118       NaN       NaN  0.605965
2       NaN  0.740122  0.528813       NaN
3  0.188695       NaN       NaN  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [33]:
df[df['W']>0]

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [34]:
df[df['W']>0]['Y']

0    0.907969
1   -0.848077
3   -0.933237
4    2.605967
Name: Y, dtype: float64

In [35]:
df[df['W']>0][['Y','X']]

          Y         X
0  0.907969  0.628133
1 -0.848077 -0.319318
3 -0.933237 -0.758872
4  2.605967  1.978757

For two conditions you can use | and & with parenthesis:

In [36]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
4  0.190794  1.978757  2.605967  0.683509

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [37]:
df

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [38]:
# Reset to default 0,1...n index
df.reset_index()

   index         W         X         Y         Z
0      0  2.706850  0.628133  0.907969  0.503826
1      1  0.651118 -0.319318 -0.848077  0.605965
2      2 -2.018168  0.740122  0.528813 -0.589001
3      3  0.188695 -0.758872 -0.933237  0.955057
4      4  0.190794  1.978757  2.605967  0.683509

In [39]:
newind = 'CA NY WY OR CO'.split()

In [40]:
df['States'] = newind

In [41]:
df

          W         X         Y         Z States
0  2.706850  0.628133  0.907969  0.503826     CA
1  0.651118 -0.319318 -0.848077  0.605965     NY
2 -2.018168  0.740122  0.528813 -0.589001     WY
3  0.188695 -0.758872 -0.933237  0.955057     OR
4  0.190794  1.978757  2.605967  0.683509     CO

In [42]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z States
0  2.706850  0.628133  0.907969  0.503826     CA
1  0.651118 -0.319318 -0.848077  0.605965     NY
2 -2.018168  0.740122  0.528813 -0.589001     WY
3  0.188695 -0.758872 -0.933237  0.955057     OR
4  0.190794  1.978757  2.605967  0.683509     CO

In [44]:
df.set_index('States',inplace=True)

In [45]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [3]:
# Sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': ['a', 'b', 'c', 'd']
})

# Setting 'B' as the new index
df.set_index('B', inplace=True)
print(df)

   A
B
a  1
b  2
c  3
d  4

In [4]:
# Sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': ['a', 'b', 'c', 'd']
})

# Setting 'B' as the new index
df.set_index('B', inplace=False)
print(df)

   A  B
0  1  a
1  2  b
2  3  c
3  4  d

## Map

In [46]:
a=[1,2,3,4,5]
b=['a','b','c','d','e']
df=pd.DataFrame(a,b,columns=['A'])
df

   A
a  1
b  2
c  3
d  4
e  5

In [47]:
dmap={1:'one',2:'two',3:'three',4:'four'}

In [48]:
df['A'].map(dmap)

a      one
b      two
c    three
d     four
e      NaN
Name: A, dtype: object

Missing data

Reindexing is indeed a powerful feature in pandas that allows you to change, add, or delete the index on a specified axis. It returns a new DataFrame with the specified changes applied, leaving the original DataFrame unchanged.

In [7]:
import pandas as pd
import numpy as np

# Create a date range
dates = pd.date_range("20230101", periods=6)

# Create a DataFrame
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2023-01-01 -0.692341 -0.498054  1.055996  0.376563
2023-01-02 -0.279396  1.079914  1.395253 -0.650857
2023-01-03  1.097432 -0.571378 -0.357715 -0.275325
2023-01-04 -0.490287  1.477846 -1.252265  1.372729
2023-01-05  0.555679  1.731990 -2.134164 -1.069460
2023-01-06 -0.973182  3.495017  0.209621 -0.539469

In [8]:
# Reindex the DataFrame
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

# Set values in the new column 'E'
df1.loc[dates[0]:dates[1], "E"] = 1

# Display the reindexed DataFrame
df1

                   A         B         C         D    E
2023-01-01 -0.692341 -0.498054  1.055996  0.376563  1.0
2023-01-02 -0.279396  1.079914  1.395253 -0.650857  1.0
2023-01-03  1.097432 -0.571378 -0.357715 -0.275325  NaN
2023-01-04 -0.490287  1.477846 -1.252265  1.372729  NaN

In [9]:
import pandas as pd
import numpy as np

# Original DataFrame
dates = pd.date_range("20230101", periods=4)
df = pd.DataFrame(np.random.randn(4, 2), index=dates, columns=["A", "B"])
print("Original DataFrame:")
print(df)

# Reindex to new dates (change index)
new_dates = pd.date_range("20230103", periods=4)
df_changed = df.reindex(new_dates)
print("\nDataFrame with Changed Index:")
print(df_changed)

Original DataFrame:
                   A         B
2023-01-01 -0.236313 -0.134760
2023-01-02  0.714451  0.899746
2023-01-03 -0.821844 -0.525552
2023-01-04 -1.240235 -0.113155

DataFrame with Changed Index:
                   A         B
2023-01-03 -0.821844 -0.525552
2023-01-04 -1.240235 -0.113155
2023-01-05       NaN       NaN
2023-01-06       NaN       NaN

In [10]:
# Add new rows by reindexing
new_dates_with_extra = pd.date_range("20230101", periods=6)
df_added_rows = df.reindex(new_dates_with_extra)
print("\nDataFrame with Added Rows:")
print(df_added_rows)

DataFrame with Added Rows:
                   A         B
2023-01-01 -0.236313 -0.134760
2023-01-02  0.714451  0.899746
2023-01-03 -0.821844 -0.525552
2023-01-04 -1.240235 -0.113155
2023-01-05       NaN       NaN
2023-01-06       NaN       NaN

In [11]:
# Add new column by reindexing
df_added_column = df.reindex(columns=["A", "B", "C"])
df_added_column["C"] = 0  # Optionally, fill the new column with a value
print("\nDataFrame with Added Column:")
print(df_added_column)

DataFrame with Added Column:
                   A         B  C
2023-01-01 -0.236313 -0.134760  0
2023-01-02  0.714451  0.899746  0
2023-01-03 -0.821844 -0.525552  0
2023-01-04 -1.240235 -0.113155  0

In [12]:
# Delete rows by reindexing
df_deleted_rows = df.reindex(dates[1:3])
print("\nDataFrame with Deleted Rows:")
print(df_deleted_rows)

DataFrame with Deleted Rows:
                   A         B
2023-01-02  0.714451  0.899746
2023-01-03 -0.821844 -0.525552

In [13]:
# Delete a column by reindexing
df_deleted_column = df.reindex(columns=["A"])
print("\nDataFrame with Deleted Column:")
print(df_deleted_column)

DataFrame with Deleted Column:
                   A
2023-01-01 -0.236313
2023-01-02  0.714451
2023-01-03 -0.821844
2023-01-04 -1.240235

The code snippet you've provided creates a Pandas Series with specific values and then shifts the data by 2 periods.

Here’s a breakdown:

Creating a Series:

pd.Series([1, 3, 5, np.nan, 6, 8], index=dates) creates a Pandas Series with the values [1, 3, 5, np.nan, 6, 8] and an index specified by dates.
np.nan is used to represent a missing value (Not a Number).
Shifting the Series:

.shift(2) shifts the data in the Series by 2 periods. This means each element moves two positions down, and the first two positions will be filled with NaN due to the shift.

In [4]:
import pandas as pd
import numpy as np

# Example dates index
dates = pd.date_range("20230101", periods=6)

# Creating the Series
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)

# Shifting the Series by 2 periods
shifted_s = s.shift(2)

print(shifted_s)

2023-01-01    NaN
2023-01-02    NaN
2023-01-03    1.0
2023-01-04    3.0
2023-01-05    5.0
2023-01-06    NaN
Freq: D, dtype: float64

## User defined functions

df.agg():

The agg method is used to apply one or more functions to the columns or rows of a DataFrame.
It allows for a variety of operations, including aggregation, transformation, or applying custom functions.

Lambda Function:

lambda x: np.mean(x) * 5.6 is a lambda function that takes each column (x) of the DataFrame, calculates the mean using np.mean(x), and then multiplies that mean by 5.6.

A lambda function in Python is a small, anonymous function that is defined without a name. It's often used for short, simple operations where defining a full function would be overkill. The syntax for a lambda function is:

lambda arguments: expression

In [7]:
import pandas as pd
import numpy as np

data = {
    'A': [1, 2, 3, 4],
    'B': [10, 20, 30, 40],
    'C': [100, 200, 300, 400]
}
df = pd.DataFrame(data)


m=df.agg(lambda x:np.mean(x)*5.6)
print(m)
s=df.agg(lambda x:np.sum(x)*5.6)
print(s)

A      14.0
B     140.0
C    1400.0
dtype: float64
A      56.0
B     560.0
C    5600.0
dtype: float64

***

## Value Counts

The value_counts() function counts the occurrence of each unique value in the Series and returns the counts in a descending order.

In [10]:
s=pd.Series(np.random.randint(0,9,size=10))
print('orginal')
print(s)
v=s.value_counts()
v

orginal
0    5
1    3
2    6
3    1
4    0
5    5
6    8
7    2
8    3
9    8
dtype: int32

5    2
3    2
8    2
6    1
1    1
0    1
2    1
Name: count, dtype: int64

## String Methods

In [16]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

#lowercase
l=s.str.lower()
print('lower')
print(l)

#uppercase
l=s.str.upper()
print('upper')
print(l)



#count the no A in each row
l=s.str.count('A')
print('count=')
print(l)

lower
0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object
upper
0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object
count=
0    1.0
1    0.0
2    0.0
3    1.0
4    0.0
5    NaN
6    2.0
7    0.0
8    0.0
dtype: float64

## merge

The merge function in Pandas is similar to SQL joins and is used to combine two DataFrames based on a common column or index.

In [17]:
import pandas as pd

# Create two DataFrames
df1 = pd.DataFrame({
    'key': ['A', 'B', 'C', 'D'],
    'value1': [1, 2, 3, 4]
})

df2 = pd.DataFrame({
    'key': ['B', 'D', 'E', 'F'],
    'value2': [5, 6, 7, 8]
})

merged_df=pd.merge(df1,df2,on='key')
merged_df

  key  value1  value2
0   B       2       5
1   D       4       6

## 2. Concat
The concat function in Pandas is used to concatenate multiple Series or DataFrame objects along a particular axis (either rows or columns).

Here, the outer join includes all columns, while the inner join would only include the rows where both DataFrames have data, but since both DataFrames have the same index, they look identical.

In [22]:
# Create two DataFrames
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5']
})


concatinated=pd.concat([df1,df2])
print(concatinated)

#outer join
concatinated=pd.concat([df1,df2],join='outer')
print(concatinated)

concatinated=pd.concat([df1,df2],join='inner')
print(concatinated)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5

## 3. Join
The join method is used to combine two DataFrames based on their indexes or on a key column. It is similar to merge, but often simpler to use when combining DataFrames based on their indexes.

In [24]:
import pandas as pd

# Create two DataFrames
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
}, index=['K0', 'K1', 'K2'])

df2 = pd.DataFrame({
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']
}, index=['K0', 'K2', 'K3'])

# Join the DataFrames on their indexes
joined_df = df1.join(df2, how='inner')
print(joined_df)
#outer
joined_df = df1.join(df2, how='outer')
print(joined_df)

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C1  D1
      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2